from Classes.Views.BaseCountriesView import BaseCountriesView


class EuropaView(BaseCountriesView):
    def __init__(self, bot, embed_info, author):
        self.countries = {"Германия": "🇩🇪", "Франция": "🇫🇷", "Великобритания": "🇬🇧", "Италия": "🇮🇹", "Испания": "🇪🇸", "Португалия": "🇵🇹",
                          "Нидерланды": "🇳🇱", "Бельгия": "🇧🇪", "Люксембург": "🇱🇺", "Швейцария": "🇨🇭", "Польша": "🇵🇱",
                          "Чехословакия": "🇨🇿", "Австрия": "🇦🇹", "Югославия": "🇷🇸", "Болгария": "🇧🇬", "Венгрия": "🇭🇺", "Румыния": "🇷🇴",
                          "Греция": "🇬🇷", "Албания": "🇦🇱", "Финляндия": "🇫🇮", "Швеция": "🇸🇪", "Норвегия": "🇳🇴", "Дания": "🇩🇰",
                          "Ирландия": "🇮🇪"}
        super().__init__(bot, embed_info, author, self.countries)
